backend/artillery.config.yml
# 1) Same DB as API: npm run seed:loadtest-user
# 2) From backend/: npm run loadtest
#    (sets LOADTEST_TOKEN + runs Artillery; avoids bcrypt-heavy POST /login in the mix)
#
# NOTE: "Login Flow" is NOT included here — under load, POST /login + bcrypt still fails/timeouts
# and fails the whole vuser. To stress-test login alone, use: npx artillery run artillery.login.yml
#
config:
  target: "http://localhost:5000"
  processor: "./artillery-processor.js"
  http:
    timeout: 120
  phases:
    - duration: 30
      arrivalRate: 5
      name: "Warm-up"
    - duration: 60
      arrivalRate: 5
      rampTo: 20
      name: "Ramp-up"
    - duration: 60
      arrivalRate: 20
      name: "Peak Load"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Public Health Check"
    weight: 15
    flow:
      - get:
          url: "/api/health"
          expect:
            - statusCode: 200

  - name: "Appliances Read"
    weight: 50
    flow:
      - function: "loadTokenFromEnv"
      - get:
          url: "/api/appliances"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200

  - name: "Submit Meter Reading"
    weight: 35
    flow:
      - function: "loadTokenFromEnv"
      - function: "setFreshReadingDate"
      - post:
          url: "/api/readings"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            readingValue: 500
            readingDate: "{{ readingDate }}"
            notes: "Artillery load test reading"
          expect:
            - statusCode: 201