backend/artillery.config.yml
config:
  target: "http://localhost:5000"   # change to your deployed URL for cloud testing
  phases:
    - duration: 30       # warm-up: 30 seconds
      arrivalRate: 5
      name: "Warm-up"
    - duration: 60       # ramp-up: 60 seconds
      arrivalRate: 5
      rampTo: 20
      name: "Ramp-up"
    - duration: 60       # sustained load: 60 seconds at peak
      arrivalRate: 20
      name: "Peak Load"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  # ── Scenario 1: Public endpoints (no auth needed) ──────────────────────────
  - name: "Public Health Check"
    weight: 10
    flow:
      - get:
          url: "/api/health"
          expect:
            - statusCode: 200

  # ── Scenario 2: Auth flow ───────────────────────────────────────────────────
  - name: "Login Flow"
    weight: 20
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "loadtest@powerwise.test"
            password: "LoadTest123!"
          capture:
            - json: "$.token"
              as: "token"
          expect:
            - statusCode: 200

  # ── Scenario 3: Appliances CRUD ────────────────────────────────────────────
  - name: "Appliances Read"
    weight: 40
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "loadtest@powerwise.test"
            password: "LoadTest123!"
          capture:
            - json: "$.token"
              as: "token"
      - get:
          url: "/api/appliances"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200

  # ── Scenario 4: Readings ────────────────────────────────────────────────────
  - name: "Submit Meter Reading"
    weight: 30
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "loadtest@powerwise.test"
            password: "LoadTest123!"
          capture:
            - json: "$.token"
              as: "token"
      - post:
          url: "/api/readings"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            readingValue: 500
            readingDate: "2026-04-10T10:00:00.000Z"
            notes: "Artillery load test reading"
          expect:
            - statusCode: 201